/* array.c
 * RESULTS:
##################################################
定义数组:
	int a[5] = {11, 12, 23, 34, 45};
[注意] 数组名代表了数组的首地址。
a的首地址:	0x7fff12a95680	a[0]的值:	11
a[1]的地址:	0x7fff12a95684	a[1]的值:	12
a[2]的地址:	0x7fff12a95688	a[2]的值:	23
a[3]的地址:	0x7fff12a9568c	a[3]的值:	34
a[4]的地址:	0x7fff12a95690	a[4]的值:	45
数组a占用内存:	20 bytes
定义指针:
	int * p;
为指针赋值:
	p = a;
[注意] a是地址常量，指针不是地址！指针是用于存储地址的变量。
p+0指向的地址:	0x7fff12a95680	存储的值:	11
p+1指向的地址:	0x7fff12a95684	存储的值:	12
p+2指向的地址:	0x7fff12a95688	存储的值:	23
p+3指向的地址:	0x7fff12a9568c	存储的值:	34
p+4指向的地址:	0x7fff12a95690	存储的值:	45
指针是用于存储地址的变量，指针也有地址:
	&p
指针p的地址:	0x7fff12a95678	存储的值:	0x7fff12a95680
指针p占用内存:	8 bytes
对a取址:
	&a
a的首地址:	0x7fff12a95680	&a:		0x7fff12a95680
[注意] a和&a是一样的!
数组a的内存图如下:
	+----------------+
	|              45|
	+----------------+ a+4:	0x7fff12a95690
	|              34|
	+----------------+ a+3:	0x7fff12a9568c
	|              23|
	+----------------+ a+2:	0x7fff12a95688
	|              12|
	+----------------+ a+1:	0x7fff12a95684
	|              11|
	+----------------+ a:	0x7fff12a95680
	|  0x7fff12a95680|
	+----------------+ p:	0x7fff12a95678
##################################################
 */
#include <stdio.h>

void main()
{
    int a[5] = {11, 12, 23, 34, 45};
    printf("定义数组:\n\tint a[5] = {11, 12, 23, 34, 45};\n");
    printf("[注意] 数组名代表了数组的首地址。\n");
    printf("a的首地址:\t%p\ta[0]的值:\t%d\n", a, *(a+0));
    printf("a[1]的地址:\t%p\ta[1]的值:\t%d\n", a+1, *(a+1));
    printf("a[2]的地址:\t%p\ta[2]的值:\t%d\n", a+2, *(a+2));
    printf("a[3]的地址:\t%p\ta[3]的值:\t%d\n", a+3, *(a+3));
    printf("a[4]的地址:\t%p\ta[4]的值:\t%d\n", a+4, *(a+4));
    printf("数组a占用内存:\t%ld bytes\n", sizeof(a));

    int * p;
    printf("定义指针:\n\tint * p;\n");
    p = a;
    printf("为指针赋值:\n\tp = a;\n");
    printf("[注意] a是地址常量，指针不是地址！指针是用于存储地址的变量。\n");
    printf("p+0指向的地址:\t%p\t存储的值:\t%d\n", p+0, *(p+0));
    printf("p+1指向的地址:\t%p\t存储的值:\t%d\n", p+1, *(p+1));
    printf("p+2指向的地址:\t%p\t存储的值:\t%d\n", p+2, *(p+2));
    printf("p+3指向的地址:\t%p\t存储的值:\t%d\n", p+3, *(p+3));
    printf("p+4指向的地址:\t%p\t存储的值:\t%d\n", p+4, *(p+4));

    printf("指针是用于存储地址的变量，指针也有地址:\n\t&p\n");
    printf("指针p的地址:\t%p\t存储的值:\t%p\n", &p, p);
    printf("指针p占用内存:\t%ld bytes\n", sizeof(p));
    printf("对a取址:\n\t&a\n");
    printf("a的首地址:\t%p\t&a:\t\t%p\n", a, &a);
    printf("[注意] a和&a是一样的!\n");

    printf("数组a的内存图如下:\n");
    printf("\t+----------------+\n");
    printf("\t|%16d|\n",*(p+4));
    printf("\t+----------------+ a+4:\t%p\n", p+4);
    printf("\t|%16d|\n",*(p+3));
    printf("\t+----------------+ a+3:\t%p\n", p+3);
    printf("\t|%16d|\n",*(p+2));
    printf("\t+----------------+ a+2:\t%p\n", p+2);
    printf("\t|%16d|\n",*(p+1));
    printf("\t+----------------+ a+1:\t%p\n", p+1);
    printf("\t|%16d|\n",*(p+0));
    printf("\t+----------------+ a:\t%p\n", p);
    printf("\t|%16p|\n",p);
    printf("\t+----------------+ p:\t%p\n", &p);
}
