#include <stdio.h>

void main()
{
    int a[2][3] = {1,3,5,4,6,8};
    printf("定义数组:\n\tint a[2][3] = {{1,3,5},{4,6,8}};\n");
    printf("a:\t%p\n",a);
    printf("&a:\t%p\n",&a);
    printf("二维数组a的内存图如下:\n");
    printf("\t+--+----------------+\n");
    printf("\t+  |%16d+\n",*(*(a+1)+2));
    printf("\t+  |----------------+ *(a+1)+2:\t%p\n", *(a+1)+2);
    printf("\t+  |%16d+\n",*(*(a+1)+1));
    printf("\t+  |----------------+ *(a+1)+1:\t%p\n", *(a+1)+1);
    printf("\t+  |%16d+\n",*(*(a+1)+0));
    printf("    a+1 +--+----------------+ *(a+1)+0:\t%p\n", *(a+1)+0);
    printf("\t+  |%16d+\n",*(*(a+0)+2));
    printf("\t+  |----------------+ *(a+0)+2:\t%p\n", *(a+0)+2);
    printf("\t+  |%16d+\n",*(*(a+0)+1));
    printf("\t+  |----------------+ *(a+0)+1:\t%p\n", *(a+0)+1);
    printf("\t+  |%16d+ *(*(a+0)+0): **a \n",*(*(a+0)+0));
    printf("      a +--+----------------+ *(a+0)+0:\t%p\n", *(a+0)+0);

    int (*pa)[3];
    printf("定义数组指针:\n\tint (*pa)[3];\n");
    pa = a;
    printf("为指针赋值:\n\tpa = &arr;\n");
    printf("数组a的内存图如下:\n");
    printf("\t+--+----------------+\n");
    printf("\t+  |%16d+\n",*(*(a+1)+2));
    printf("\t+  |----------------+ *(a+1)+2:\t%p\n", *(a+1)+2);
    printf("\t+  |%16d+\n",*(*(a+1)+1));
    printf("\t+  |----------------+ *(a+1)+1:\t%p\n", *(a+1)+1);
    printf("\t+  |%16d+\n",*(*(a+1)+0));
    printf("    a+1 +--+----------------+ *(a+1)+0:\t%p\n", *(a+1)+0);
    printf("\t+  |%16d+\n",*(*(a+0)+2));
    printf("\t+  |----------------+ *(a+0)+2:\t%p\n", *(a+0)+2);
    printf("\t+  |%16d+\n",*(*(a+0)+1));
    printf("\t+  |----------------+ *(a+0)+1:\t%p\n", *(a+0)+1);
    printf("\t+  |%16d+ *(*(pa+0)+0): **pa \n",**pa);
    printf("      a +--+----------------+ *(a+0)+0:\t%p\n", *(a+0)+0);
    printf("\t+  |%16p+ pa \n",pa);
    printf("\t+--+----------------+ &pa:\t%p\n", &pa);

    int i = 10;
    printf("定义整型变量:\n\tint i = 10;\n");
    int *p = &i;
    printf("定义指针并赋值:\n\tint *p = &i;\n");
    int **p2 = &p;
    printf("定义二级指针并赋值:\n\tint **p2 = &p;\n");
    printf("内存图如下:\n");
    printf("\t+--+----------------+\n");
    printf("\t+  |%16d+\n",*(*(a+1)+2));
    printf("\t+  |----------------+ *(a+1)+2:\t%p\n", *(a+1)+2);
    printf("\t+  |%16d+\n",*(*(a+1)+1));
    printf("\t+  |----------------+ *(a+1)+1:\t%p\n", *(a+1)+1);
    printf("\t+  |%16d+\n",*(*(a+1)+0));
    printf("    a+1 +--+----------------+ *(a+1)+0:\t%p\n", *(a+1)+0);
    printf("\t+  |%16d+\n",*(*(a+0)+2));
    printf("\t+  |----------------+ *(a+0)+2:\t%p\n", *(a+0)+2);
    printf("\t+  |%16d+\n",*(*(a+0)+1));
    printf("\t+  |----------------+ *(a+0)+1:\t%p\n", *(a+0)+1);
    printf("\t+  |%16d+ *(*(pa+0)+0): **pa \n",**pa);
    printf("      a +--+----------------+ *(a+0)+0:\t%p\n", *(a+0)+0);
    printf("\t+  |%16p+ pa \n",pa);
    printf("\t+--+----------------+ &pa:\t%p\n", &pa);
    printf("\t+  |%16d+ i, *p, **p2\n",i);
    printf("\t+--+----------------+ &i:\t%p\n",p);
    printf("\t+  |%16p+ p\n",p);
    printf("\t+--+----------------+ &p:\t%p\n",p2);
    printf("\t+  |%16p+ p2\n",p2);
    printf("\t+--+----------------+\n");

    printf("[注意] a是地址常量，不可赋值\n");
    printf("[注意] **pa和**p2的含义不同，前者是数组指针，后者是二级指针。\n");
}
